;---------------------------------------------
;---           WEAPON PREFIX NAME          ---
;---------------------------------------------
[GrimyLoot_Research]
m_strRareName=老兵
m_strEpicName=指挥官
m_strLegendaryName=传奇

[GrimyLoot_UIScreen]
m_strRareName=老兵
m_strEpicName=指挥官
m_strLegendaryName=传奇

+ChoiceNames="制造 突击步枪"
+ChoiceNames="制造 霰弹枪"
+ChoiceNames="制造 加农炮"
+ChoiceNames="制造 狙击枪"
+ChoiceNames="制造 冲锋枪"
+ChoiceNames="制造 维克托步枪"
+ChoiceNames="制造 无托式机枪"

+ChoiceNames="制造 轻型装甲"
+ChoiceNames="制造 中型装甲"
+ChoiceNames="制造 重型装甲"
+ChoiceNames="制造 死神护甲"
+ChoiceNames="制造 散兵护甲"
+ChoiceNames="制造 圣殿骑士护甲"

+ChoiceNames="制造 手枪"
+ChoiceNames="制造 自动手枪"
+ChoiceNames="制造 剑"
+ChoiceNames="制造 开颅刃"
+ChoiceNames="制造 碎片拳刃"
+ChoiceNames="制造 小精灵"
+ChoiceNames="制造 榴弹发射器"
+ChoiceNames="制造 灵能增幅器"

+ChoiceNames="制造 Spark Bit"
+ChoiceNames="制造 Spark 自动加农炮"
+ChoiceNames="制造 Spark 机身"

[GrimyLoot_ScreenListener_MCM]
MOD_NAME="Grimy's Loot Mod"

ARTIFACTS_HEADER="保险箱价格"
ARTIFACTS_TITLE1="老兵保险箱价格"
ARTIFACTS_TITLE2="指挥官保险箱价格"
ARTIFACTS_TITLE3="传奇保险箱价格"
ARTIFACTS_DESCRIPTION="黑市能换成补给，需要重启游戏以应用。"

UPGRADES_HEADER="部件价格"
UPGRADES_TITLE1="老兵部件价格"
UPGRADES_TITLE2="指挥官部件价格"
UPGRADES_TITLE3="传奇部件价格"
UPGRADES_DESCRIPTION="黑市能换成补给，需要重启游戏以应用。"

EQUIPMENT_HEADER="装备价格"
EQUIPMENT_TITLE1="老兵装备价格"
EQUIPMENT_TITLE2="指挥官装备价格"
EQUIPMENT_TITLE3="传奇装备价格"
EQUIPMENT_DESCRIPTION="黑市能换成补给，需要重启游戏以应用。"

RESEARCH_HEADER="研究时间"

RESEARCH_TITLE1="老兵研究时间"
RESEARCH_TITLE2="指挥官研究时间"
RESEARCH_TITLE3="传奇研究时间"
RESEARCH_DESCRIPTION="打开保险箱花费的时间，需要重启游戏以应用。"

RESEARCH_INC_TITLE1="老兵研究时间增加"
RESEARCH_INC_TITLE2="指挥官研究时间增加"
RESEARCH_INC_TITLE3="传奇研究时间增加"
RESEARCH_INC_DESCRIPTION="每次打开后下次打开增加的时间花费，需要重启游戏以应用。"

ARMOR_HEADER="护甲几率"
ARMOR_DESCRIPTION1="开出轻型护甲几率"
ARMOR_DESCRIPTION2="开出重型护甲几率"
ARMOR_TITLE1="轻型护甲几率"
ARMOR_TITLE2="重型护甲几率"

UNLOCK_HEADER="装备几率"
UNLOCK_DESCRIPTION1="开出主武器几率，顺序在护甲之前。"
UNLOCK_DESCRIPTION2="护甲几率。如果开出失败，将得到副武器。"
UNLOCK_TITLE1="武器解锁几率"
UNLOCK_TITLE2="护甲解锁几率"

;---------------------------------------------
;---             ENCYCLOPEDIA              ---
;---------------------------------------------
[GrimyLoot_ScreenListener_UIInventory_Storage]
kToggle="切换 收集图册"
kCompletion="完成"